# Text Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement..::..Text Property
TextElement Class See Also
---
The content of the element as a plain string stripped of all formating.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Text { get; set; }
```

Visual Basic
---
```text
Public Property Text As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
If a new text content is set, all previous formating that might have been set on parts of the original text will be lost. After setting the new text, only the formating parameters of the associated text type will be applied.
The value of this property can also be accessed via the TEXT_TEXT Built-In parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TextElement Class
Autodesk.Revit.DB Namespace